benchmarks/faaasc-artillery/suites copy/warehouse/revenue-pred/artillery.http.yaml
config:
  target: https://kuouohrlooq4pldhmurmrksufe0wkbpa.lambda-url.eu-west-2.on.aws
  http:
    timeout: 30
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 1
      name: Warm up phase
    - duration: 20
      arrivalRate: 1
      name: Maximum AWS Lambda instance load
    - duration: 10
      arrivalRate: 1
      rampTo: 1
      name: Decrease load
  plugins:
    expect: {}
    apdex: {}
    metrics-by-endpoint:
      useOnlyRequestNames: true
    fake-data: {}
  processor: "./payload.mjs"
scenarios:
  - flow:
      - post:
          url: "/"
          beforeRequest: "preparePayload"
          json: "{{ payload }}"